GetWorksharingDisplayMode Method
 Gets the current worksharing display mode for this view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public WorksharingDisplayMode GetWorksharingDisplayMode()
  Visual Basic
Public Function GetWorksharingDisplayMode As WorksharingDisplayMode
  Visual C++
public:
WorksharingDisplayMode GetWorksharingDisplayMode()
 Return Value
 The active worksharing display mode in this view.
 Remarks
 Returns "Off" if no worksharing display mode is currently enabled.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →